import 'package:palnt_app/Model/Plant.dart';

const listdataslider = [
  "تمت زراعة أشجار الزيتون في سوريا منذ آلاف السنين، مع أدلة أثرية تشير إلى أنها تم تدجينها حوالي 6000 قبل الميلاد. وهي تلعب دورًا حاسمًا في الثقافة والتاريخ السوريين، حيث يتم ذكرها في النصوص القديمة وترتبط بالتقاليد الدينية المختلفة",
  "تعد زراعة الزيتون جزءًا حيويًا من الاقتصاد الزراعي السوري. كانت البلاد ذات يوم واحدة من أكبر منتجي الزيتون وزيت الزيتون في العالم قبل بدء الصراع الأهلي في عام 2011. ولا يزال إنتاج زيت الزيتون مصدرا أساسيا للدخل بالنسبة للعديد من الأسر الريفية، مما يسهم إسهاما كبيرا في الاقتصادات المحلية",
  "تُزرع العنب في سوريا منذ آلاف السنين، مما يجعل المنطقة واحدة من أقدم مناطق إنتاج النبيذ في العالم. تشير الأدلة الأثرية إلى أن زراعة العنب تعود إلى الحضارات القديمة، بما في ذلك الفينيقيون والرومان، الذين قدروا العنب ليس فقط للأكل ولكن أيضًا لصناعة النبيذ",
  "كان القطن محصولًا حيويًا في سوريا لعدة قرون، لا سيما في المناطق الشمالية الشرقية مثل الحسكة والرقة. كان البلد في يوم من الأيام أحد أكبر منتجي القطن في الشرق الأوسط، حيث ساهم بشكل كبير في كل من الاقتصادات المحلية والصادرات. من الناحية التاريخية، كان القطن السوري معروفًا بجودته العالية، مما جعله خيارًا مفضلًا لمصنعي المنسوجات",
  "يعد القمح أحد أهم المحاصيل الأساسية في سوريا، حيث يساهم بشكل كبير في الاقتصاد الزراعي للبلاد. يزرع في المقام الأول في المناطق الشمالية والشرقية، حيث المناخ وظروف التربة مواتية لزراعة القمح. تعتمد البلاد تقليديًا على القمح كمصدر غذائي أولي، حيث تعتبر أصناف مثل القمح القاسي مهمة بشكل خاص لإنتاج المعكرونة",
  "في الثقافة السورية، يحتل النعناع مكانة مهمة ليس فقط كعشب طهي ولكن أيضًا كرمز للضيافة. غالبًا ما يستخدم لإعداد الأطباق التقليدية مثل التبولة ويتم تقديمه عادة مع الشاي. يعد طعم ورائحة العشب المنعشة جزءًا لا يتجزأ من العديد من التجمعات والوجبات الاجتماعية",
  "يُزرع الزعتر في سوريا منذ آلاف السنين، وتشير السجلات التاريخية إلى استخدامه في الحضارات القديمة. تم تقييم العشب ليس فقط لتطبيقاته في الطهي ولكن أيضًا لخصائصه الطبية. استخدم المصريون القدماء الزعتر في عملية التحنيط، بينما ربطه اليونانيون والرومان بالشجاعة واستخدموه في حماماتهم وكعامل نكهة",
  "تزدهر أشجار القرنفل في المناخات الاستوائية، مما يعني أنه بينما يمكن زراعتها في مناطق مختلفة، فإنها تتطلب ظروفًا محددة للازدهار. في سوريا، توفر المناطق الساحلية مناخًا صغيرًا أكثر ملاءمة لزراعة القرنفل بسبب ارتفاع درجات الحرارة وارتفاع مستويات الرطوبة مقارنة بالمناطق الداخلية. يجب أن تكون التربة مجففة جيدًا وغنية بالمواد العضوية وحمضية قليلاً إلى محايدة (pH 6-7) لتحقيق النمو الأمثل.",
  "يُزرع الكركديه، وخاصة نوع Hibiscus sabdariffa، على نطاق واسع في سوريا لكلساتها الحمراء النابضة بالحياة، والتي تُستخدم لصنع مشروب شهير يُعرف باسم «Karkadeh». يتم الاستمتاع بهذا المشروب الساخن والبارد وغالبًا ما يتم تحليته بالسكر أو العسل. Karkadeh ليس مشروبًا منعشًا فحسب، بل له أيضًا أهمية ثقافية، حيث يتم تقديمه خلال المناسبات والتجمعات الخاصة.",
  "تُزرع الخزامى في سوريا منذ قرون، لا سيما في المناطق الجبلية من البلاد. تعتبر ظروف المناخ والتربة في مناطق مثل جبال القلمون مثالية لزراعة الخزامى، والذي تم استخدامه تقليديًا ليس فقط لخصائصه العطرية ولكن أيضًا للأغراض الطبية. إن زراعة الخزامى متجذرة بعمق في الثقافة السورية، حيث ترتبط غالبًا بالممارسات التقليدية والحرفية المحلية",
  "يتناسب عباد الشمس تمامًا مع مناخ سوريا، الذي يتميز بمناخ البحر الأبيض المتوسط الذي يتميز بصيف حار وجاف وشتاء معتدل ورطب. تسمح هذه القدرة على التكيف لعباد الشمس بالازدهار في مناطق مختلفة في جميع أنحاء البلاد، مما يجعلها محصولًا شائعًا بين المزارعين المحليين. تعزز درجات الحرارة الدافئة خلال موسم النمو النمو الصحي والإزهار",
  "تمت زراعة الفستق في سوريا منذ آلاف السنين، مع أدلة تشير إلى أنها نمت منذ 5000 قبل الميلاد. مناخ المنطقة وظروف التربة مواتية بشكل خاص لزراعة الفستق، مما يجعلها واحدة من أقدم المناطق المعروفة لإنتاج الفستق الحلبي.",
  "وردة دمشق، المعروفة علميًا باسم روزا دمشق، لها تاريخ غني يعود إلى العصور القديمة. يُعتقد أنه نشأ في الشرق الأوسط، لا سيما في منطقة سوريا، حيث تمت زراعته منذ أكثر من 2000 عام. غالبًا ما ترتبط الوردة بمدينة دمشق المشهورة بحدائقها الرائعة وأزهارها العطرة. تاريخيًا، تم استخدام هذه الزهرة ليس فقط لأغراض الزينة ولكن أيضًا لزيوتها ومستخلصاتها الأساسية في العطور ومستحضرات التجميل والطب التقليدي",
  "تُزرع الياسمين في سوريا منذ قرون، وتعود أصولها إلى العصور القديمة. النبات متأصل بعمق في الثقافة والتاريخ السوري، وغالبًا ما يرتبط بالحب والجمال. كثيرًا ما يتم ذكره في الشعر والأدب، مما يرمز إلى النقاء والنعمة. تشتهر مدينة دمشق على وجه الخصوص بحدائق الياسمين التي ساهمت في سمعة المنطقة كمركز لزراعة الأزهار",
];

List<Plant> listplant = [
  Plant(
      assetpath: "assets/images/photo1.jpg",
      name: "زيتون",
      scientificName: "Olea Europaea",
      type: "قيسي الانتشار",
      tips: [
        "تمت زراعة أشجار الزيتون في سوريا منذ آلاف السنين، مع أدلة أثرية تشير إلى أنها تم تدجينها حوالي 6000 قبل الميلاد. وهي تلعب دورًا حاسمًا في الثقافة والتاريخ السوريين، حيث يتم ذكرها في النصوص القديمة وترتبط بالتقاليد الدينية المختلفة.",
        "تعد زراعة الزيتون جزءًا حيويًا من الاقتصاد الزراعي السوري. كانت البلاد ذات يوم واحدة من أكبر منتجي الزيتون وزيت الزيتون في العالم قبل بدء الصراع الأهلي في عام 2011. ولا يزال إنتاج زيت الزيتون مصدرا أساسيا للدخل بالنسبة للعديد من الأسر الريفية، مما يسهم إسهاما كبيرا في الاقتصادات المحلية.",
        "في سوريا، هناك العديد من الأصناف المحلية من الزيتون، كل منها يتكيف مع الظروف المناخية المحددة وأنواع التربة. تشمل بعض الأصناف البارزة «Souri» المعروف بزيته عالي الجودة و «Kalamata» الشهير بزيتون المائدة. يساعد هذا التنوع البيولوجي على ضمان المرونة ضد الآفات والأمراض.",
        "إحدى الحقائق الممتعة حول أشجار الزيتون في سوريا هي أنها غالبًا ما يشار إليها باسم «شجرة السلام». ينبع هذا التصنيف من أهميتها الثقافية طويلة الأمد وقدرتها على الازدهار في بيئات صعبة، مما يرمز إلى المرونة والأمل للعديد من المجتمعات."
      ]),
  Plant(
      assetpath: "assets/images/photo2.jpg",
      name: "عنب",
      scientificName: "Vitis Vinifera",
      type: "كرمة متسلقة",
      tips: [
        "تُزرع العنب في سوريا منذ آلاف السنين، مما يجعل المنطقة واحدة من أقدم مناطق إنتاج النبيذ في العالم. تشير الأدلة الأثرية إلى أن زراعة العنب تعود إلى الحضارات القديمة، بما في ذلك الفينيقيون والرومان، الذين قدروا العنب ليس فقط للأكل ولكن أيضًا لصناعة النبيذ.",
        "سوريا هي موطن لمجموعة متنوعة من أنواع العنب، سواء عنب المائدة أو تلك المستخدمة في صناعة النبيذ. تشمل بعض الأصناف البارزة «الدباس»، الذي يُزرع بشكل أساسي للاستهلاك كفاكهة طازجة، و «الخليلي» المعروف باستخدامه في النبيذ السوري التقليدي. يسمح المناخ المتنوع عبر مناطق مختلفة من سوريا بزراعة أنواع مختلفة من العنب تتناسب مع الظروف المحلية.",
        "يلعب العنب دورًا مهمًا في الاقتصاد الزراعي السوري. وهي أحد المحاصيل الرئيسية المزروعة في البلد، وتساهم في كل من الاستهلاك المحلي وأسواق التصدير. يدعم إنتاج العنب المزارعين المحليين وهو جزء لا يتجزأ من سبل العيش الريفية، خاصة في مناطق مثل حلب وحمص حيث تنتشر مزارع الكروم.",
        "في الثقافة السورية، يحمل العنب أهمية رمزية تتجاوز قيمته الزراعية. غالبًا ما ترتبط بالخصوبة والوفرة وتظهر في أطباق واحتفالات تقليدية مختلفة. بالإضافة إلى ذلك، تستخدم أوراق العنب بشكل شائع في الطهي، خاصة في أطباق مثل ورق العنب، والتي تتكون من أوراق الكرمة المحشوة بالأرز واللحوم."
      ]),
  Plant(
      assetpath: "assets/images/photo3.jpg",
      name: "قطن",
      tips: [
        "كان القطن محصولًا حيويًا في سوريا لعدة قرون، لا سيما في المناطق الشمالية الشرقية مثل الحسكة والرقة. كان البلد في يوم من الأيام أحد أكبر منتجي القطن في الشرق الأوسط، حيث ساهم بشكل كبير في كل من الاقتصادات المحلية والصادرات. من الناحية التاريخية، كان القطن السوري معروفًا بجودته العالية، مما جعله خيارًا مفضلًا لمصنعي المنسوجات.",
        "مناخ سوريا مؤات لزراعة القطن، ويتميز بالصيف الحار والري الكافي من الأنهار مثل نهر الفرات. يستخدم المزارعون عادةً الأساليب التقليدية جنبًا إلى جنب مع الممارسات الزراعية الحديثة لتعزيز الغلة. ومع ذلك، فإن ندرة المياه بسبب الجفاف المطول وسوء إدارة الموارد المائية شكلت تحديات لزراعة القطن في السنوات الأخيرة.",
        "يلعب إنتاج القطن دورًا مهمًا في الاقتصاد السوري، حيث يوفر سبل العيش لآلاف المزارعين والعاملين في صناعات الحلج والنسيج. على الرغم من مواجهة اضطرابات كبيرة بسبب النزاع المستمر منذ عام 2011، فقد تم بذل جهود لإنعاش هذا القطاع كجزء من مبادرات الانتعاش الاقتصادي الأوسع.",
        "سوريا هي موطن لأصناف فريدة من القطن تتكيف مع الظروف المحلية. يُعرف أحد هذه الأنواع باسم «الأبيض السوري»، والذي يتم تقديره ليس فقط لجودة الألياف ولكن أيضًا لمرونته ضد الآفات والأمراض مقارنة بأنواع القطن الأخرى المزروعة على مستوى العالم."
      ],
      scientificName: "Gossypium sp",
      type: "شجيرات (خبازيات)"),
  Plant(
      assetpath: "assets/images/photo4.jpg",
      name: "قمح",
      scientificName: "Triticum",
      type: "حبوب",
      tips: [
        "يعد القمح أحد أهم المحاصيل الأساسية في سوريا، حيث يساهم بشكل كبير في الاقتصاد الزراعي للبلاد. يزرع في المقام الأول في المناطق الشمالية والشرقية، حيث المناخ وظروف التربة مواتية لزراعة القمح. تعتمد البلاد تقليديًا على القمح كمصدر غذائي أولي، حيث تعتبر أصناف مثل القمح القاسي مهمة بشكل خاص لإنتاج المعكرونة.",
        "أثر الصراع المستمر في سوريا بشدة على إنتاج القمح خلال العقد الماضي. وقد تضررت البنية التحتية الزراعية، وشرد العديد من المزارعين، مما أدى إلى انخفاض كمية ونوعية القمح المنتج. وفقًا لتقارير من مختلف المنظمات الزراعية، أدى هذا الاضطراب إلى زيادة انعدام الأمن الغذائي داخل البلاد، مما جعل من الصعب على العديد من السوريين الحصول على إمدادات غذائية كافية.",
        "يلعب المناخ السوري دورًا حاسمًا في زراعة القمح. تشهد البلاد مناخًا متوسطًا يتميز بصيف حار وجاف وشتاء معتدل ورطب. وتؤدي هذه الظروف إلى زراعة القمح ؛ ومع ذلك، فإن التقلبات في أنماط هطول الأمطار بسبب تغير المناخ أثارت مخاوف بشأن الغلات المستقبلية. غالبًا ما يعتمد المزارعون على الزراعة البعلية، مما يجعلهم عرضة لحالات الجفاف التي يمكن أن تؤثر بشكل كبير على إنتاج المحاصيل.",
        "يُزرع القمح في سوريا منذ آلاف السنين ويعتبر من أقدم المحاصيل المستأنسة. تشير الأدلة الأثرية إلى أن الأسلاف البرية للقمح الحديث تم حصادها لأول مرة في منطقة الهلال الخصيب، والتي تضم أجزاء من سوريا الحالية. هذه الأهمية التاريخية لا تبرز فقط أهمية القمح كمصدر غذائي ولكن أيضًا ارتباطه الراسخ بالثقافة والزراعة السورية."
      ]),
  Plant(
      assetpath: "assets/images/photo5.jpg",
      name: "نعناع",
      scientificName: "Mentha",
      type: "شفويات",
      tips: [
        "تُزرع النعناع بأشكال مختلفة في جميع أنحاء سوريا، وأكثر الأنواع شيوعًا هي النعناع الرمادي (Mentha spicata) والنعناع (Mentha × piperita). تُفضل هذه الأصناف لنكهاتها المتميزة وخصائصها العطرية، مما يجعلها شائعة في تطبيقات الطهي والطب التقليدي وشاي الأعشاب.",
        "في الثقافة السورية، يحتل النعناع مكانة مهمة ليس فقط كعشب طهي ولكن أيضًا كرمز للضيافة. غالبًا ما يستخدم لإعداد الأطباق التقليدية مثل التبولة ويتم تقديمه عادة مع الشاي. يعد طعم ورائحة العشب المنعشة جزءًا لا يتجزأ من العديد من التجمعات والوجبات الاجتماعية.",
        "عادة ما تحدث زراعة النعناع في سوريا في التربة المصفاة جيدًا مع رطوبة وفيرة. غالبًا ما يستخدم المزارعون تقنيات الري لضمان النمو المستمر، خاصة في المناطق التي قد يكون فيها هطول الأمطار غير كافٍ. يوفر مناخ سوريا، الذي يتميز بصيف حار وشتاء معتدل، بيئة مثالية لزراعة النعناع.",
        "تم استخدام النعناع منذ العصور القديمة لخصائصه الطبية. في سوريا، تم استخدامه ليس فقط لأغراض الطهي ولكن أيضًا كعلاج طبيعي لمشاكل الجهاز الهضمي وأمراض الجهاز التنفسي. تشير النصوص التاريخية إلى أن النعناع كان موضع تقدير من قبل مختلف الحضارات عبر التاريخ، بما في ذلك اليونانيين والرومان، الذين اعترفوا بفوائده الصحية."
      ]),
  Plant(
      assetpath: "assets/images/photo6.jpg",
      name: "زعتر",
      scientificName: "Thymus Vulgaris",
      type: "عشبة دائمة الخضرة",
      tips: [
        "يُزرع الزعتر في سوريا منذ آلاف السنين، وتشير السجلات التاريخية إلى استخدامه في الحضارات القديمة. تم تقييم العشب ليس فقط لتطبيقاته في الطهي ولكن أيضًا لخصائصه الطبية. استخدم المصريون القدماء الزعتر في عملية التحنيط، بينما ربطه اليونانيون والرومان بالشجاعة واستخدموه في حماماتهم وكعامل نكهة.",
        "سوريا هي موطن لعدة أنواع من الزعتر، بما في ذلك ثيموس فولغاريس (الزعتر الشائع) وتيموس سيرياكوس (الزعتر السوري). يسمح المناخ المتنوع في البلاد، بدءًا من البحر الأبيض المتوسط على طول الساحل إلى المناطق الداخلية القاحلة، بنمو هذه الأنواع في بيئات مختلفة. يزدهر الزعتر في التربة المجففة جيدًا ويتطلب ضوء الشمس الكامل، مما يجعل التضاريس الجبلية في سوريا مناسبة بشكل خاص لزراعتها.",
        "يلعب الزعتر دورًا مهمًا في الاقتصاد الزراعي في سوريا. وهو لا يستهلك محليًا فحسب بل يُصدر أيضًا إلى بلدان مختلفة بسبب ارتفاع الطلب عليه في الأسواق الدولية. العشبة جزء لا يتجزأ من المطبخ السوري التقليدي، وغالبًا ما تستخدم في أطباق مثل الزعتر (مزيج التوابل) ومستحضرات اللحوم المختلفة، مما يساهم في كل من الاستهلاك المحلي وعائدات التصدير.",
        "في الثقافة السورية، الزعتر هو أكثر من مجرد عشبة طهي؛ إنه يرمز إلى كرم الضيافة والدفء. غالبًا ما يتم تضمينه في الأطباق التقليدية التي يتم تقديمها أثناء التجمعات والاحتفالات، مما يعكس أهمية مشاركة الطعام كوسيلة للجمع بين الناس. بالإضافة إلى ذلك، يتم إهداء الزيوت المملوءة بالزعتر أحيانًا كرموز للنوايا الحسنة بين الأصدقاء والعائلة."
      ]),
  Plant(
      assetpath: "assets/images/photo7.jpg",
      name: "قرنفل",
      scientificName: "Syzygium Aromaticum",
      type: "نبتة فصلية آسية",
      tips: [
        "تزدهر أشجار القرنفل في المناخات الاستوائية، مما يعني أنه بينما يمكن زراعتها في مناطق مختلفة، فإنها تتطلب ظروفًا محددة للازدهار. في سوريا، توفر المناطق الساحلية مناخًا صغيرًا أكثر ملاءمة لزراعة القرنفل بسبب ارتفاع درجات الحرارة وارتفاع مستويات الرطوبة مقارنة بالمناطق الداخلية. يجب أن تكون التربة مجففة جيدًا وغنية بالمواد العضوية وحمضية قليلاً إلى محايدة (pH 6-7) لتحقيق النمو الأمثل.",
        "للقرنفل تاريخ طويل من التجارة والاستخدام في ثقافات مختلفة، بما في ذلك تلك الموجودة في الشرق الأوسط. في سوريا، تم تقييم القرنفل تاريخيًا ليس فقط لاستخداماته في الطهي ولكن أيضًا لخصائصه الطبية. تم استخدامها في الطب التقليدي لعلاج الأمراض مثل مشاكل الجهاز الهضمي وآلام الأسنان. ساهمت طرق تجارة التوابل التي مرت عبر سوريا بشكل كبير في اقتصادها التاريخي وتبادلاتها الثقافية.",
        "على الرغم من أن القرنفل ليس أحد المنتجات الزراعية الأولية في سوريا، إلا أنه يساهم في الاقتصاد المحلي، لا سيما في المناطق التي تزرع فيها. يمكن أن توفر زراعة القرنفل للمزارعين مصدرًا إضافيًا للدخل جنبًا إلى جنب مع المحاصيل الأخرى. ومع ذلك، بسبب النزاعات المستمرة والتحديات الاقتصادية داخل البلاد، واجه الإنتاج الزراعي - بما في ذلك القرنفل - عقبات كبيرة تؤثر على كل من الغلة والوصول إلى الأسواق.",
        "في المطبخ السوري، لا تستخدم القرنفل كتوابل فحسب، بل تلعب أيضًا دورًا في المشروبات التقليدية مثل «الشاي المتبل» أو «الشاي». غالبًا ما يتضمن هذا المشروب مزيجًا من التوابل مثل القرفة والهيل والقرنفل، مما يخلق تجربة رائعة ولذيذة تعكس تراث الطهي الغني في المنطقة."
      ]),
  Plant(
      assetpath: "assets/images/photo8.jpg",
      name: "كركديه",
      scientificName: "Hibiscus Sabdariffa",
      type: "خبازيات",
      tips: [
        "يُزرع الكركديه، وخاصة نوع Hibiscus sabdariffa، على نطاق واسع في سوريا لكلساتها الحمراء النابضة بالحياة، والتي تُستخدم لصنع مشروب شهير يُعرف باسم «Karkadeh». يتم الاستمتاع بهذا المشروب الساخن والبارد وغالبًا ما يتم تحليته بالسكر أو العسل. Karkadeh ليس مشروبًا منعشًا فحسب، بل له أيضًا أهمية ثقافية، حيث يتم تقديمه خلال المناسبات والتجمعات الخاصة.",
        "تم التعرف على الكركديه لخصائصها الطبية في الطب السوري التقليدي. النبات غني بمضادات الأكسدة وقد تمت دراسته من أجل فوائده الصحية المحتملة، بما في ذلك خفض ضغط الدم، والمساعدة في الهضم، وامتلاك خصائص مضادة للالتهابات. في سوريا، غالبًا ما يتم استهلاك شاي الكركديه لفوائده الصحية، مما يجعله عنصرًا أساسيًا في العديد من الأسر.",
        "يزدهر الكركديه في المناخ الدافئ في سوريا، لا سيما في المناطق ذات التربة المجففة جيدًا وأشعة الشمس الكافية. يمكن زراعته في أنواع مختلفة من التربة ولكنه يفضل مستويات الأس الهيدروجيني الحمضية قليلاً إلى المحايدة. تسمح مرونة المصنع لها بتحمل فترات الجفاف، مما يجعلها محصولًا مثاليًا للمزارعين في المناطق التي قد تكون فيها موارد المياه محدودة.",
        "في الثقافة السورية، لا يتم تقييم زهور الكركديه فقط لاستخداماتها في الطهي ؛ كما أنها ترمز إلى الجمال والضيافة. غالبًا ما تستخدم الزهور الحمراء الزاهية في الترتيبات الزخرفية خلال المهرجانات والاحتفالات، مما يعكس الروح النابضة بالحياة للتقاليد السورية."
      ]),
  Plant(
      assetpath: "assets/images/photo9.jpg",
      name: "خزامى",
      scientificName: "Lavendula",
      type: "شفويات",
      tips: [
        "تُزرع الخزامى في سوريا منذ قرون، لا سيما في المناطق الجبلية من البلاد. تعتبر ظروف المناخ والتربة في مناطق مثل جبال القلمون مثالية لزراعة الخزامى، والذي تم استخدامه تقليديًا ليس فقط لخصائصه العطرية ولكن أيضًا للأغراض الطبية. إن زراعة الخزامى متجذرة بعمق في الثقافة السورية، حيث ترتبط غالبًا بالممارسات التقليدية والحرفية المحلية.",
        "تلعب زراعة الخزامى دورًا مهمًا في الاقتصاد المحلي لمناطق معينة في سوريا. يحظى الزيت الأساسي المستخرج من الخزامى بتقدير كبير على الصعيدين المحلي والدولي. يتم استخدامه في صناعات مختلفة، بما في ذلك مستحضرات التجميل والعطور والعلاج بالروائح. على الرغم من التحديات التي يفرضها الصراع وعدم الاستقرار الاقتصادي في السنوات الأخيرة، لا يزال الخزامى محصولًا حيويًا يدعم المزارعين المحليين ويساهم في سبل عيشهم.",
        "في سوريا، يتم زراعة العديد من أنواع الخزامى، مع Lavandula angustifolia (الخزامى الإنجليزي) واحدة من أبرز الأنواع بسبب محتواها من الزيت الأساسي عالي الجودة. قد تشمل الأصناف الأخرى Lavandula stoechas (الخزامى الإسباني)، المعروف بمسامير الزهور المميزة والمرونة في مواجهة ظروف الجفاف. غالبًا ما يعتمد اختيار التنوع على الظروف المناخية المحددة والطلب في السوق.",
        "في الثقافة السورية، لا يتم تقدير الخزامى فقط لعطره ولكن له أيضًا معنى رمزي. غالبًا ما يرتبط بالنقاء والهدوء، مما يجعله خيارًا شائعًا للاستخدام في الاحتفالات والاحتفالات التقليدية. بالإضافة إلى ذلك، تستخدم أزهار اللافندر المجففة بشكل شائع لإنشاء أكياس أو بوتبوري، مما يعكس التقدير الثقافي للروائح الطبيعية وآثارها المهدئة."
      ]),
  Plant(
      assetpath: "assets/images/photo10.jpg",
      name: "عباد الشمس",
      scientificName: "Helianthus Anuus",
      type: "نبتة مزهرة نجمية",
      tips: [
        "يتناسب عباد الشمس تمامًا مع مناخ سوريا، الذي يتميز بمناخ البحر الأبيض المتوسط الذي يتميز بصيف حار وجاف وشتاء معتدل ورطب. تسمح هذه القدرة على التكيف لعباد الشمس بالازدهار في مناطق مختلفة في جميع أنحاء البلاد، مما يجعلها محصولًا شائعًا بين المزارعين المحليين. تعزز درجات الحرارة الدافئة خلال موسم النمو النمو الصحي والإزهار.",
        "تلعب زراعة عباد الشمس دورًا مهمًا في الاقتصاد الزراعي السوري. يزرع في المقام الأول لبذوره، والتي تتم معالجتها في الزيت وتستخدم في الطهي وكذلك في منتجات غذائية مختلفة. يعتبر زيت عباد الشمس أحد زيوت الطهي الأكثر صحة بسبب محتواه العالي من الدهون غير المشبعة وانخفاض مستويات الدهون المشبعة. ويسهم إنتاج زيت عباد الشمس في كل من الاستهلاك المحلي وفرص التصدير.",
        "غالبًا ما يستخدم المزارعون في سوريا عباد الشمس كجزء من ممارسات تناوب المحاصيل. تساعد هذه الطريقة في تحسين صحة التربة عن طريق تقليل أعداد الآفات وتعزيز دورة المغذيات. من خلال التناوب بين عباد الشمس والمحاصيل الأخرى، يمكن للمزارعين الحفاظ على خصوبة التربة وتقليل مخاطر الأمراض التي تصيب نباتات معينة.",
        "تشهر عباد الشمس بارتفاعها الرائع ؛ يمكن أن يصل ارتفاع بعض الأصناف إلى 12 قدمًا أو أكثر! هذا الارتفاع الرائع لا يجعلها مذهلة بصريًا فحسب، بل يسمح لها أيضًا بالتقاط ضوء الشمس بشكل أكثر فعالية من النباتات الأقصر، مما يساهم في معدل نموها السريع."
      ]),
  Plant(
      assetpath: "assets/images/photo11.jpg",
      name: "فستق حلبي",
      scientificName: "Pistacia Vera",
      type: "نبتة بطمية",
      tips: [
        "تمت زراعة الفستق في سوريا منذ آلاف السنين، مع أدلة تشير إلى أنها نمت منذ 5000 قبل الميلاد. مناخ المنطقة وظروف التربة مواتية بشكل خاص لزراعة الفستق، مما يجعلها واحدة من أقدم المناطق المعروفة لإنتاج الفستق الحلبي.",
        "سوريا هي واحدة من أكبر منتجي الفستق الحلبي في الشرق الأوسط، حيث تساهم بشكل كبير في الاقتصاد الزراعي للبلاد. توفر زراعة الفستق سبل العيش للعديد من المزارعين وتؤدي دورًا حاسمًا في كل من الاقتصادات المحلية والوطنية. على الرغم من التحديات مثل عدم الاستقرار السياسي وندرة المياه، تظل زراعة الفستق قطاعًا حيويًا.",
        "سوريا هي موطن للعديد من أنواع الفستق المحلية، بما في ذلك صنف «حلب»، الذي يحظى بتقدير كبير لنكهته وجودته. تتكيف هذه الأصناف بشكل جيد مع البيئة المحلية وتساهم في ملف الذوق الفريد الذي يميز الفستق السوري عن تلك المزروعة في مناطق أخرى.",
        "غالبًا ما يشار إلى الفستق باسم «الذهب الأخضر» في سوريا نظرًا لارتفاع قيمته السوقية والطلب عليه محليًا ودوليًا. لا يعكس هذا اللقب أهميتها الاقتصادية فحسب، بل يعكس أيضًا أهميتها الثقافية داخل المطبخ السوري، حيث يتم استخدامها في الأطباق والحلويات التقليدية المختلفة."
      ]),
  Plant(
      assetpath: "assets/images/photo12.jpg",
      name: "ورد دمشقي",
      scientificName: "Rosa Damascena",
      type: "نبتة وعائية",
      tips: [
        "وردة دمشق، المعروفة علميًا باسم روزا دمشق، لها تاريخ غني يعود إلى العصور القديمة. يُعتقد أنه نشأ في الشرق الأوسط، لا سيما في منطقة سوريا، حيث تمت زراعته منذ أكثر من 2000 عام. غالبًا ما ترتبط الوردة بمدينة دمشق المشهورة بحدائقها الرائعة وأزهارها العطرة. تاريخيًا، تم استخدام هذه الزهرة ليس فقط لأغراض الزينة ولكن أيضًا لزيوتها ومستخلصاتها الأساسية في العطور ومستحضرات التجميل والطب التقليدي.",
        "في سوريا، تحدث زراعة ورود دمشق عادة في المناطق الجبلية حيث يكون المناخ مثاليًا لنموها. تزدهر النباتات في التربة المجففة جيدًا وتتطلب مناخًا معتدلًا مع ضوء الشمس الكافي. يقام موسم الحصاد بشكل عام في مايو ويونيو عندما تكون الزهور في ذروتها. يقوم المزارعون باختيار البتلات الدقيقة يدويًا في وقت مبكر من الصباح عندما لا يزالون مغلقين للحفاظ على عطرهم. هذه العملية كثيفة العمالة أمر بالغ الأهمية لأنها تتطلب ما يقرب من 4000 كيلوغرام من البتلات لإنتاج كيلوغرام واحد فقط من زيت الورد.",
        "تلعب وردة دمشق دورًا حيويًا في الاقتصاد السوري، لا سيما في المجتمعات الريفية حيث توفر سبل العيش للعديد من العائلات المشاركة في زراعتها ومعالجتها. الزيت العطري المستخرج من هذه الورود مطلوب بشدة على مستوى العالم لاستخدامه في العطور الراقية ومنتجات العلاج بالروائح. بالإضافة إلى ذلك، يصنع الحرفيون المحليون منتجات مختلفة مثل ماء الورد والعلاجات العشبية من البتلات، مما يساهم في كل من الاقتصادات المحلية والتراث الثقافي.",
        "غالبًا ما يشار إلى وردة دمشق باسم «ملكة الزهور» بسبب جمالها المذهل وعطرها الساحر. ومن المثير للاهتمام أنه أصبح أيضًا رمزًا للحب والعاطفة عبر الثقافات المختلفة عبر التاريخ. في الأدب والفن، غالبًا ما تمثل هذه الزهرة الجمال والرومانسية ؛ وبالتالي، فقد ألهمت عددًا لا يحصى من القصائد والأغاني والأعمال الفنية المخصصة لجاذبيتها."
      ]),
  Plant(
      assetpath: "assets/images/photo13.jpg",
      name: "ياسمين",
      scientificName: "Jasminum",
      type: "نبتة وعائية",
      tips: [
        "تُزرع الياسمين في سوريا منذ قرون، وتعود أصولها إلى العصور القديمة. النبات متأصل بعمق في الثقافة والتاريخ السوري، وغالبًا ما يرتبط بالحب والجمال. كثيرًا ما يتم ذكره في الشعر والأدب، مما يرمز إلى النقاء والنعمة. تشتهر مدينة دمشق على وجه الخصوص بحدائق الياسمين التي ساهمت في سمعة المنطقة كمركز لزراعة الأزهار.",
        "في سوريا، أكثر أنواع الياسمين شيوعًا هي الياسمينوم سامباك، والمعروفة أيضًا باسم الياسمين العربي. يتم تقدير هذا النوع لزهوره البيضاء العطرة ويستخدم على نطاق واسع في العطور والممارسات التقليدية. تشمل الأصناف الأخرى Jasminum grandiflorum، والذي يُزرع أيضًا لخصائصه العطرية. تزدهر هذه الأصناف في مناخ البحر الأبيض المتوسط الموجود في أجزاء كثيرة من سوريا، وتستفيد من فصول الصيف الدافئة وفصول الشتاء المعتدلة.",
        "تلعب زراعة الياسمين دورًا مهمًا في الاقتصاد المحلي لسوريا. يتم حصاد الزهور ليس فقط لأغراض الزينة ولكن أيضًا لزيوتها الأساسية التي تستخدم في العطور ومستحضرات التجميل. ويسهم تصدير منتجات الياسمين في كسب عيش العديد من المزارعين والحرفيين داخل المنطقة. وعلى الرغم من التحديات التي يفرضها الصراع وعدم الاستقرار الاقتصادي، تظل الياسمين محصولا قيما يدعم المجتمعات المحلية والأسواق الدولية على حد سواء.",
        "زهور الياسمين في سوريا محبوبة لدرجة أنها أصبحت رمزًا وطنيًا ؛ وغالبا ما تستخدم لتزيين المنازل خلال الاحتفالات والمهرجانات. في الواقع، رائحة الياسمين محبوبة للغاية لدرجة أنها ألهمت التعبيرات الثقافية المختلفة، بما في ذلك الموسيقى وأشكال الرقص التي تحتفل بجمال هذه الزهرة العطرة وأهميتها في الحياة السورية."
      ]),
  Plant(
      assetpath: "assets/images/photo14.jpg",
      name: "تين",
      scientificName: "Ficus Carcia",
      type: "توياتي",
      tips: [
        "يُزرع التين في سوريا منذ آلاف السنين، مما يجعله أحد أقدم الفواكه المزروعة في المنطقة. تشير الأدلة الأثرية إلى أن أشجار التين تم تدجينها منذ حوالي 11000 عام في الهلال الخصيب، الذي يضم أجزاء من سوريا الحديثة. هذا التاريخ الطويل جعل التين جزءًا لا يتجزأ من الزراعة والثقافة السورية.",
        "سوريا هي موطن لعدة أنواع من التين، بما في ذلك أنواع «البعثة السوداء» و «كادوتا» الشهيرة. مناخ البلاد، الذي يتميز بصيف حار وشتاء معتدل، يفضي إلى زراعة التين. غالبًا ما يزرع المزارعون التين في البساتين التقليدية، باستخدام الطرق البعلية والمروية لضمان إنتاج الفاكهة الصحية.",
        "يلعب التين دورًا مهمًا في الاقتصاد الزراعي في سوريا. ولا يتم استهلاكها محليا فحسب بل يتم تصديرها أيضا إلى بلدان مختلفة. ويسهم إنتاج التين في كسب عيش العديد من المزارعين وهو جزء حيوي من الاقتصادات الريفية في المناطق التي تزرع فيها.",
        "التين فريد من نوعه بين الفواكه لأنه يحتوي على بذور من الداخل وليس من الخارج، ولهذا السبب يتم تصنيفها على أنها ثمار «سيكونيوم». بالإضافة إلى طعمها اللذيذ، كان يُنظر إلى التين تاريخيًا على أنه رموز للخصوبة والازدهار عبر مختلف الثقافات، بما في ذلك ثقافة سوريا القديمة."
      ]),
  Plant(
      assetpath: "assets/images/photo15.jpg",
      name: "صنوبر",
      scientificName: "Pinus Gerardiana",
      type: "مخروطيات",
      tips: [
        "سوريا هي موطن لعدة أنواع من أشجار الصنوبر، بما في ذلك صنوبر حلب (Pinus halepensis) والصنوبر التركي (Pinus brutia). تتكيف هذه الأنواع جيدًا مع مناخ البحر الأبيض المتوسط الموجود في العديد من مناطق سوريا، وتتميز بصيف حار وجاف وشتاء معتدل ورطب. يتميز صنوبر حلب بشكل خاص بمرونته في مواجهة الجفاف وسوء ظروف التربة، مما يجعله خيارًا شائعًا لجهود إعادة التحريج في المناطق المتدهورة.",
        "تلعب غابات الصنوبر في سوريا دورًا حاسمًا في الحفاظ على التنوع البيولوجي ودعم النظم البيئية المحلية. توفر موطنًا لأنواع الحياة البرية المختلفة، بما في ذلك الطيور والثدييات، وتساهم في تثبيت التربة ومكافحة التعرية. يساعد وجود هذه الغابات في الحفاظ على التوازن الإيكولوجي داخل المنطقة، لا سيما في المناطق الجبلية حيث تنتشر.",
        "لزراعة أشجار الصنوبر آثار اقتصادية كبيرة على سوريا. الصنوبر الذي يتم حصاده من هذه الأشجار هو منتج زراعي قيم يساهم في الاقتصادات المحلية. وبالإضافة إلى ذلك، تستخدم الأخشاب من أشجار الصنوبر في البناء وصنع الأثاث، مما يوفر سبل العيش للعديد من المجتمعات المحلية العاملة في مجال الحراجة والصناعات ذات الصلة.",
        "لدى مخاريط الصنوبر آلية تكيف فريدة من نوعها ؛ يمكن أن تفتح أو تغلق على أساس مستويات الرطوبة. في الظروف الجافة، يظل الصنوبر مغلقًا لحماية بذوره من الجفاف. عندما تزداد الرطوبة، فإنها تنفتح على إطلاق البذور في البيئة للإنبات. تساعد هذه الميزة البيولوجية الرائعة في التكاثر الناجح لأشجار الصنوبر عبر مناخات مختلفة."
      ]),
  Plant(
      assetpath: "assets/images/photo16.jpg",
      name: "ليمون",
      scientificName: "Citrus Limon",
      type: "سذابيات",
      tips: [
        "يزدهر الليمون في مناخ البحر الأبيض المتوسط الموجود في العديد من مناطق سوريا، لا سيما على طول المناطق الساحلية. تخلق درجات الحرارة الدافئة وضوء الشمس الوفير والتربة المجففة جيدًا ظروفًا مثالية لزراعة الليمون. تستفيد المناطق الساحلية من فصول الشتاء المعتدلة والصيف الحار، مما يؤدي إلى نمو الحمضيات. بالإضافة إلى ذلك، غالبًا ما تكون التربة في هذه المناطق غنية بالمواد العضوية، مما يعزز إمكانات نمو أشجار الليمون.",
        "تلعب زراعة الليمون دورًا مهمًا في الاقتصاد الزراعي السوري. الليمون هو أحد الحمضيات الرئيسية المنتجة في البلاد ويساهم في كل من الاستهلاك المحلي وأسواق التصدير. وتوفر زراعة الليمون سبل العيش للعديد من المزارعين وتدعم مختلف الصناعات مثل تجهيز الأغذية وإنتاج المشروبات. على الرغم من التحديات التي يفرضها الصراع وعدم الاستقرار الاقتصادي، لا يزال إنتاج الليمون جزءًا حيويًا من المشهد الزراعي في سوريا.",
        "تزرع سوريا العديد من أنواع الليمون، مع كون اليوريكا ولشبونة من بين الأكثر شعبية. تُفضل هذه الأصناف لمحتوى العصير العالي والنكهة القوية. قد تختلف ممارسات الزراعة اختلافًا طفيفًا حسب التنوع، ولكنها تتطلب عمومًا رعاية مماثلة فيما يتعلق بالري وإدارة الآفات وتقنيات الحصاد.",
        "في الثقافة السورية، لا يتم تقييم الليمون لاستخداماته في الطهي فحسب، بل له أيضًا أهمية رمزية. وكثيرا ما ترتبط بالضيافة والكرم ؛ تقديم المشروبات أو الأطباق التي تحتوي على الليمون للضيوف هي ممارسة شائعة تعكس الدفء والترحيب. علاوة على ذلك، يتم استخدام الليمون في الطب التقليدي داخل المجتمعات السورية لفوائدها الصحية المتصورة."
      ])
];

List<Plant> listplantforadd = [
  Plant(
    assetpath: "assets/images/photo1.jpg",
    name: "ياسمين",
    tips: [
      "1. عند اختيار الياسمين للنمو الداخلي، ضع في اعتبارك أصناف مثل ياسمينوم بوليانثوم (الياسمين الصيني) أو ياسمينوم سامباك (الياسمين العربي). هذه الأنواع مناسبة تمامًا لزراعة الأواني ويمكن أن تزدهر في الداخل بعناية مناسبة.",
      "2. تتطلب نباتات الياسمين أشعة الشمس الساطعة وغير المباشرة لتزدهر. ضعها بالقرب من نافذة حيث يمكنهم تلقي ما لا يقل عن 4-6 ساعات من الضوء يوميًا. ومع ذلك، تجنب ضوء الشمس المباشر لأنه يمكن أن يحرق الأوراق.",
      "3. سقي الياسمين عندما يشعر الجزء العلوي من التربة بالجفاف عند اللمس. تفضل الياسمين التربة الرطبة باستمرار ولكنها لا تتحمل الظروف المشبعة بالمياه. يمكن أن يؤدي الإفراط في الماء إلى تعفن الجذر، لذا تأكد من الصرف المناسب في الأواني.",
      "4. تزدهر الياسمين في الرطوبة العالية، من الناحية المثالية بين 40-60٪. للحفاظ على مستويات الرطوبة، ضع في اعتبارك استخدام مرطب أو وضع صينية من الماء مع الحصى تحت القدر. يمكن أن يساعد ضرب الأوراق من حين لآخر.",
      "5. قم بإطعام الياسمين الخاص بك بسماد سائل متوازن كل 4-6 أسابيع خلال موسم النمو (الربيع والصيف). سيشجع السماد الذي يحتوي على نسبة عالية من الفوسفور على الازدهار ويعزز النمو الصحي.",
      "6. التقليم المنتظم ضروري للحفاظ على الشكل وتشجيع نمو الأدغال. قم بقص أي أوراق ميتة أو صفراء واستهلاك الزهور بعد الازدهار لتعزيز نمو جديد والوقاية من المرض.",
      "7. احترس من الآفات الشائعة مثل المن وعث العنكبوت والذباب الأبيض. إذا لاحظت أي إصابات، فعليك علاجها على الفور بصابون مبيدات الحشرات أو زيت النيم للحفاظ على صحة نباتك.",
      "8. تفضل الياسمين درجات الحرارة بين 60 درجة فهرنهايت إلى 75 درجة فهرنهايت (15 درجة مئوية إلى 24 درجة مئوية) خلال النهار وأكثر برودة قليلاً في الليل. تجنب تعريض نباتك للمسودات أو التغيرات المفاجئة في درجات الحرارة التي قد تضغط عليه.",
      "9. لتشجيع الإزهار، تأكد من أن الياسمين الخاص بك يتلقى الضوء والمغذيات الكافية خلال موسم النمو. قد تتطلب بعض الأصناف فترة من درجات الحرارة الأكثر برودة لبدء الإزهار ؛ البحث عن احتياجات محددة على أساس التنوع الذي تختاره.",
      "10. الأهمية الثقافية للياسمين لا تحظى الياسمين بالإعجاب لجمالها فحسب، بل لها أيضًا أهمية ثقافية في العديد من المناطق حول العالم. في بعض الثقافات، يرمز إلى الحب والنقاء ؛ وغالبا ما يستخدم في العطور والشاي بسبب رائحته العطرة.",
    ],
  ),
  Plant(
    assetpath: "assets/images/photo1.jpg",
    name: "الورد الدمشقي",
    tips: [
      "1. تزدهر ورود دمشق في ضوء الشمس الساطع وغير المباشر. من الناحية المثالية، يجب أن يتلقوا 6 ساعات على الأقل من الضوء يوميًا. إذا نمت في الداخل، فإن وضعها بالقرب من نافذة مواجهة للجنوب أمر مفيد. ومع ذلك، تجنب ضوء الشمس القاسي المباشر الذي يمكن أن يحرق الأوراق.",
      "2. استخدم تربة جيدة التصريف غنية بالمواد العضوية. يعمل مزيج من تربة الأواني مع السماد أو السماد القديم بشكل جيد لتوفير العناصر الغذائية اللازمة مع ضمان الصرف المناسب. يجب أن يكون مستوى الأس الهيدروجيني حمضيًا قليلاً إلى محايد (حوالي 6.0 إلى 7.0).",
      "3. تجنب الإفراط في الماء. يجب أن يجف الجزء العلوي من التربة بين المياه. خلال موسم النمو (الربيع والصيف)، المياه بشكل متكرر، مع تقليل الري أثناء السكون في الخريف والشتاء.",
      "4. أطعم وردة دمشق بسماد متوازن كل 4-6 أسابيع خلال موسم النمو. ابحث عن الأسمدة الغنية بالبوتاسيوم والفوسفور لتعزيز الازدهار والصحة العامة. الخيارات العضوية مثل مستحلب الأسماك أو شاي السماد هي خيارات ممتازة.",
      "5. قم بتقليم شجيرة الورد سنويًا في أواخر الشتاء أو أوائل الربيع قبل أن يبدأ النمو الجديد. قم بإزالة الخشب الميت أو المريض وشكل النبات لتشجيع المركز المفتوح لتحسين الدورة الدموية للهواء، مما يساعد على الوقاية من الأمراض.",
      "6. مراقبة الآفات الشائعة مثل المن وعث العنكبوت والذباب الأبيض. استخدام صابون مبيدات الحشرات أو زيت النيم كعلاجات طبيعية في حالة حدوث الإصابة. سيساعد فحص نباتاتك بانتظام في اكتشاف المشكلات مبكرًا.",
      "7. حافظ على مستويات رطوبة معتدلة حول نبات وردة دمشق. يمكن أن تكون البيئات الداخلية جافة ؛ فكر في استخدام مرطب أو وضع صينية ماء بالقرب من النبات لزيادة مستويات الرطوبة دون جعل التربة رطبة.",
      "8. تفضل ورود دمشق درجات الحرارة بين 60 درجة فهرنهايت إلى 75 درجة فهرنهايت (15 درجة مئوية إلى 24 درجة مئوية). يمكنها تحمل درجات حرارة أكثر برودة قليلاً ولكن يجب حمايتها من الصقيع والحرارة الشديدة.",
      "9. يمكنك نشر ورود دمشق من خلال القصاصات أو تقنيات التطعيم. خذ قصاصات شبه خشبية في أواخر الصيف وضعها في مزيج أواني رطب حتى تتطور الجذور، وعادة ما تستغرق عدة أسابيع.",
      "10. تشتهر وردة دمشق بعطرها وغالبًا ما تستخدم في العطور ومستحضرات التجميل بسبب خصائصها العطرية في الزيوت الأساسية. بالإضافة إلى ذلك، لها أهمية تاريخية تعود إلى آلاف السنين وغالبًا ما ترتبط بالحب والجمال عبر الثقافات المختلفة.",
    ],
  ),
  Plant(
    assetpath: "assets/images/photo5.jpg",
    name: "نعنع",
    tips: [
      "1. تزدهر النعناع في الحاويات، مما يساعد على التحكم في نموها الغازي. حدد وعاء لا يقل عمقه عن 12 بوصة وله ثقوب تصريف لمنع التشبع بالمياه. الأواني الطينية مثالية لأنها تسمح للرطوبة بالتبخر، مما يحافظ على صحة الجذور.",
      "2. استخدم تربة جيدة التصريف تحتفظ ببعض الرطوبة ولكنها تسمح للمياه الزائدة بالهروب. يعمل مزيج من تربة الأواني مع البرليت أو الرمال بشكل جيد. يفضل النعناع مستويات الأس الهيدروجيني الحمضية قليلاً إلى المحايدة (حوالي 6.0 إلى 7.0).",
      "3. تفضل نباتات النعناع الظل الجزئي على الشمس الكاملة، حيث تتلقى بشكل مثالي حوالي 4-6 ساعات من ضوء الشمس يوميًا. إذا لاحظت أن الأوراق تتحول إلى اللون الأصفر أو الذبول، فقد تحصل على الكثير من ضوء الشمس المباشر.",
      "4. حافظ على التربة رطبة باستمرار ولكن ليست رطبة. سقي النعناع عندما يشعر الجزء العلوي من التربة بالجفاف عند اللمس. يمكن أن يؤدي الإفراط في الماء إلى تعفن الجذر، بينما يمكن أن يتسبب نقص الماء في ذبول الأوراق.",
      "5. لا يتطلب النعناع تخصيبًا ثقيلًا، ولكن يمكنك إطعامه بسماد سائل متوازن كل شهر خلال موسم النمو (الربيع والصيف). سيعزز هذا النمو الخصب والنكهة النابضة بالحياة.",
      "6. يشجع التقليم المنتظم على نمو الأدغال ويمنع الإزهار، مما قد يجعل طعم الأوراق مريرًا. اقص السيقان فوق عقدة الأوراق مباشرة ؛ وهذا من شأنه أن يحفز النمو الجديد. يمكنك حصاد أوراق النعناع في أي وقت، ولكن من الأفضل القيام بذلك في الصباح عندما تكون الزيوت أكثر تركيزًا.",
      "7. كن يقظًا بشأن الآفات مثل المن وعث العنكبوت التي قد تغزو نبات النعناع. تشمل العلاجات الطبيعية رش الصابون المبيد للحشرات أو زيت النيم، وهو فعال دون الإضرار بالحشرات المفيدة. . اعتبارات المناخ الداخلي",
      "يفضل النعناع درجات الحرارة بين 60 درجة فهرنهايت إلى 70 درجة فهرنهايت (15 درجة مئوية إلى 21 درجة مئوية) في الداخل. تجنب وضعه بالقرب من المسودات أو فتحات التدفئة، حيث يمكن أن تؤدي التغيرات المفاجئة في درجات الحرارة إلى إجهاد النبات.",
      "9. يمكنك بسهولة نشر النعناع من خلال قصاصات أو تقسيم الجذور: قطع ساق صحية أسفل العقدة مباشرة ووضعها في الماء حتى تتطور الجذور، ثم زرعها في التربة ؛ بدلاً من ذلك، قسّم النبات القائم إلى أقسام أصغر أثناء إعادة التوزيع.",
      "10. تشتهر النعناع بخصائصها العطرية، مما يجعلها شائعة في أطباق الطهي والشاي وحتى الزيوت الأساسية ،هناك أكثر من 30 نوعًا من النعناع، مثل النعناع (Mentha × piperita) والنعناع (Mentha spicata) وهم الأكثر شيوعًا.",
    ],
  ),
  Plant(name: "زيتون"),
  Plant(name: "عنب"),
  Plant(name: "قطن"),
  Plant(name: "قمح"),
  Plant(name: "زعتر"),
  Plant(name: "قرنفل"),
  Plant(name: "كركديه"),
  Plant(name: "خزامى"),
  Plant(name: "عباد الشمس"),
  Plant(name: "فستق حلبي"),
  Plant(name: "فستق"),
  Plant(name: "تين"),
  Plant(name: "صنوبر"),
  Plant(name: "ليمون"),
];

const List<String> days = [
  "السبت",
  "الأحد",
  "الاثنين",
  "الثلاثاء",
  "الأربعاء",
  "الخميس",
  "الجمعة",
];

const List<String> tasks = [
  "الري",
  "التسميد",
  "التغذية",
  "التعريض لضوء الشمس",
  "الري بماء المطر",
];
